# Titanic Survival

#### Grading:


- Code: 90 pts
- Markdown Documentation: 10 pts

We are going to study the survival rate of passengers on titanic and what variables affected survival.

Load the dataset in `titanic.xls`. It contains data on all the passengers that travelled on the Titanic.

In [1]:
from IPython.core.display import HTML
HTML(filename='../data/titanic.html'),

(<IPython.core.display.HTML object>,)

In [13]:
# you would need xlrd - pip install xlrd
import pandas as pd
t_file = pd.ExcelFile('../data/titanic.xls')
t_df = t_file.parse("titanic")
t_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [14]:
t_df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

### Keeping columns and dropping NA values

In [17]:
t_df = t_df[['pclass','survived','sex','age']]
t_df.dropna(inplace=True)

### Women and children first?

*** 1. Use the `groupby` method to calculate the proportion of passengers that survived by sex. (10 pts)***

### Grouping by sex and survived and using the sex column (no missing values)to calculate proportion of total survived.

In [18]:
t_df.groupby(['sex','survived'])['survived'].count()/t_df.groupby(['sex'])['survived'].count()*100

sex     survived
female  0           24.742268
        1           75.257732
male    0           79.483283
        1           20.516717
Name: survived, dtype: float64

*** 2. Calculate the same proportion, but by class and sex. (10 pts)***

### The same thing can be achieved by adding `pclass` to the groupby statement

In [19]:
(t_df.groupby(['sex','pclass','survived'])['survived'].count()/t_df.groupby(['sex','pclass'])['survived'].count())*100

sex     pclass  survived
female  1       0            3.759398
                1           96.240602
        2       0           10.679612
                1           89.320388
        3       0           52.631579
                1           47.368421
male    1       0           64.900662
                1           35.099338
        2       0           85.443038
                1           14.556962
        3       0           83.094556
                1           16.905444
Name: survived, dtype: float64

*** 3. Create age categories: children (under 14 years), adolescents (14-20), adult (21-64), and senior(65+), and calculate survival proportions by age category, class and sex. (20 pts)***

### We can create the categories many different ways. I chose to use np.select simply because the code is better read this way. It assigns the category by evaluating a number of statements. The corresponding index of the true statement is matched the the corresponding index of the label in the second list.

In [22]:
import numpy as np
t_df['age_group'] = np.select([
    t_df['age'].between(0,13, inclusive = True),
    t_df['age'].between(14,20.99, inclusive = True),
    t_df['age'].between(21,64, inclusive = True),
    t_df['age'].between(65,999, inclusive = True),
],
[
    'children',
    'adolescents',
    'adult',
    'senior'
    
],
default = 'unknown_age')

t_df.groupby('age_group').count()

             pclass  survived  sex  age
age_group
adolescents     150       150  150  150
adult           784       784  784  784
children         99        99   99   99
senior           13        13   13   13

In [27]:
((t_df.groupby(['survived',
               'sex',
               'pclass',
               'age_group'])['survived'].count()/t_df.groupby(['sex',
                                                               'pclass',
                                                              'age_group'])['survived'].count())*100).to_frame()

                                      survived
sex    pclass age_group   survived
female 1      adolescents 1         100.000000
              adult       0           3.448276
                          1          96.551724
              children    0         100.000000
              senior      1         100.000000
       2      adolescents 0           7.692308
                          1          92.307692
              adult       0          13.157895
                          1          86.842105
              children    1         100.000000
       3      adolescents 0          45.714286
                          1          54.285714
              adult       0          55.813953
                          1          44.186047
              children    0          51.612903
                          1          48.387097
male   1      adolescents 0          80.000000
                          1          20.000000
              adult       0          65.671642
                          1          34.328358
              children    1         100.000000
              senior      0          85.714286
                          1          14.285714
       2      adolescents 0          88.235294
                          1          11.764706
              adult       0          92.187500
                          1           7.812500
              children    1         100.000000
              senior      0         100.000000
       3      adolescents 0          87.692308
                          1          12.307692
              adult       0          84.016393
                          1          15.983607
              children    0          67.567568
                          1          32.432432
              senior      0         100.000000